interface Iquotes {
  quote: string;
  author?: string;
  description?: string;
}

const listQuotes: Array<Iquotes> = [
  {
    quote:
      '"Регрессионное тестирование? Что это? Если система компилируется, то это хорошо, если загружается, то это просто здорово!“',
    author: 'Линус Торвальдс',
    description: 'Финский программист, хакер 1969',
  },

  {
    quote:
      '"Тестирование программы может весьма эффективно продемонстрировать наличие ошибок, но безнадежно неадекватно для демонстрации их отсутствия."',
    author: 'Эдсгер Вибе Дейкстра',
    description: 'Нидерландский учёный 1930 - 2002',
  },

  {
    quote:
      '"Задача специалиста по тестированию — выявить все проблемы, которые могут возникнуть при работе с продуктом, и сделать все возможное для улучшения его качества."',
    author: 'Сэм Канер',
    description: '"Тестирование ПО"',
  },

  {
    quote:
      '"Чем больше внимания я уделяла тестированию на начальной стадии, тем меньше усилий требовалось в ручном тестировании в конце, потому что в результате возникало гораздо меньше багов."',
    description: 'Agile-тестирование',
    author: 'Лайза Криспин',
  },

  {
    quote:
      '"Тестировщики видят то, что никогда не видит человек, копающийся целыми днями в коде."',
    author: 'Джеймс Уиттакер, Джейсон Арбон',
    description: 'Как тестируют в Google',
  },

  {
    quote:
      '"Вы можете быть наделены множеством самых прекрасных и вечных добродетелей. Но в вашей работе тестировщика есть единственный смысл - РЕЗУЛЬТАТ."',
    author: 'Роман Савин',
    description: 'Тестирование Дот Ком',
  },

  {
    quote:
      '"Исследовательское тестирование оказывается невероятно продуктивным, в том числе с технической точки зрения"',
    author: 'Лайза Криспин',
    description: 'Agile-тестирование',
  },

  {
    quote:
      '"Автоматизированное регрессионное тестирование не происходит случайно. Его необходимо планировать и расширять, делая частью ежедневного процесса."',
    author: 'Лайза Криспин',
    description: 'Agile-тестирование',
  },

  {
    quote:
      '"Если создание приемочных тестов перед тем, как приступить к разработке кода, что-то и замедляет, то лишь нашу работу над кодом, который не будет функционировать."',
    author: 'Лайза Криспин',
    description: 'Agile-тестирование',
  },

  {
    quote: '"Ни одно изобретение не может сразу стать совершенным"',
    author: 'Цицерон',
  },

  {
    quote:
      '"Тестировщик чувствует себя как родитель, который, услышав легкий кашель своего ребенка, с ходу представляет самые опасные болезни."',
    author: 'Джеймс Уиттакер, Джейсон Арбон',
    description: 'Как тестируют в Google',
  },

  {
    quote:
      '"Основа бэкграунда тестировщика - это логика, здравый смысл и жизненный опыт. Народная мудрость."',
    author: 'Роман Савин',
    description:
      'Тестирование Дот Ком, или Пособие по жестокому обращению с багами в интернет-стартапах',
  },

  {
    quote:
      '"Весь мир — тестирование, и когда у нас что-то не получается — это заведённая ошибка, которую мы можем исправить. Допускать ошибки не страшно, главное — исправлять их!"',
  },

  {
    quote:
      '"Важным было то, что не команда спрашивала меня, тестировщика, как я собираюсь тестировать это. Вопрос задавался всей команде: «Как мы вместе собираемся это тестировать? Как нам сделать так, чтобы быть уверенными, что это будет работать так, как задумано?"',
    description: 'Agile-тестирование',
    author: 'Лайза Криспин',
  },
];

export default listQuotes;
